Revit 2024 API
RebarShapeConstraint Methods
The RebarShapeConstraint type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParamId
 Return the Id of the parameter associated with this constraint.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace